app/views/articles/_form.html.erb

SELECT `authors`.`name`, `authors`.`id` FROM `authors`
---
             <%= form.label :author ,:class=>"formlabel" %>
             <%= form.select :author_id, Author.all.pluck(:name, :id), { prompt: 'Select' }, { class: "form-control" } %>