app/views/articles/index.html.erb

    <%= link_to 'Post article', new_article_path,:class=>"btn btn-success newarticle"%>
    <h4 class="btn textarticles"><b class="counttext">Total articles-<badge class="articlecount label label-primary"><%= Article.count %></badge></b></h4>
---
SELECT `articles`.* FROM `articles`

           <%= form_tag(articles_path,method: :get) do %>
          <%= select_tag(:term1, options_from_collection_for_select(Category.all, :id, :name), include_blank: "Select Category", :class=>"form-control" )%>
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`article_id` = 29 LIMIT 1