app/views/articles/index.html.erb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`article_id` = 29 LIMIT 1
---
           <%= form_tag(articles_path,method: :get) do %>
          <%= select_tag(:term1, options_from_collection_for_select(Category.all, :id, :name), include_blank: "Select Category", :class=>"form-control" )%>