app/controllers/articles_controller.rb

  def index
    @articles = if params[:term]
      Article.where('title LIKE ?',"%#{params[:term]}")
      elsif params[:term1]
      Article.where('category_id LIKE ?',"%#{params[:term1]}")
      elsif params[:both]
      Article.all.includes(:author).where(authors: {name: params[:both]})
      elsif params[:not]
      Article.where.not('title LIKE ?',"%#{params[:not]}")
     elsif params[:having]
       Article.where.not(nopages:nil).having('COUNT(*)>1').group(:nopages)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles`
SELECT  `articles`.* FROM `articles` LIMIT 11

    def create
        @article = Article.new(article_params)
         if @article.save(validation:true)
---
INSERT INTO `articles` (`title`, `category`, `description`, `created_at`, `updated_at`, `author_id`) VALUES ('article', 'Comedy', 'wwwww', '2018-12-03 13:17:31', '2018-12-03 13:17:31', 1)

    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `title` = 'article1', `description` = 'article', `updated_at` = '2018-11-27 11:34:06' WHERE `articles`.`id` = 1